mengxyz/PN0031/app/ch32_v006_rewinder/src/main_heater.c
/* main_heater.c
 *
 * Heater device for CH32V006.
 * Bus USART1 RS485 460800 8N1 PD5=TX PD6=RX PD4=DE
 * PC0 ARGB, PC4 boot/status LED, PC5 heartbeat LED, PC6 heater, PC7 fan PWM
 * PA1 fan tach, PA2 power status, PC3 door, PD2/PD3 NTC ADC.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <math.h>

#include <ch32v00X.h>
#include "ch32v00X_tim.h"
#include "ch32v00X_dma.h"
#include "ch32v00X_spi.h"
#include "ch32v00X_flash.h"

#define AHBPCENR               HBPCENR
#define APB2PCENR              PB2PCENR
#define RCC_AHBPeriph_DMA1     RCC_HBPeriph_DMA1
#define RCC_APB2Periph_GPIOC   RCC_PB2Periph_GPIOC
#define RCC_APB2Periph_AFIO    RCC_PB2Periph_AFIO
#define RCC_APB2Periph_SPI1    RCC_PB2Periph_SPI1
#define GPIO_Speed_10MHz       GPIO_Speed_30MHz
#define GPIO_CNF_OUT_PP_AF     0x08
#define CTLR1_SPE_Set          ((uint16_t)0x0040)
#define WS_LED_COUNT           ARGB_LED_COUNT
#define WS2812_GPIO_PORT       GPIOC
#define WS2812_GPIO_PORT_CLOCK RCC_PB2Periph_GPIOC
#define WS2812_GPIO_PIN_INDEX  0
#define WS2812_SPI_REMAP       GPIO_PartialRemap3_SPI1
#define WS2812DMA_IMPLEMENTATION
#define DMALEDS                8
#define WSGRB
#include "lib/ws2812b_dma_spi_led_driver.h"

#define DEV_TYPE_HEATER   0x00U
#define DEVICE_TYPE       DEV_TYPE_HEATER
#define DEVICE_ADDR       0x02U
#define BROADCAST_ADDR    0xFFU

#define APP_VERSION_MAJOR 0x01U
#define APP_VERSION_MINOR 0x00U
#define APP_VERSION_PATCH 0x2AU
#define UID_WORD0         (*(volatile uint32_t *)0x1FFFF7E8U)
#define UID_WORD1         (*(volatile uint32_t *)0x1FFFF7ECU)

#define RS485_DE_PORT GPIOD
#define RS485_DE_PIN  GPIO_Pin_4
#define BOOT_LED_PORT GPIOC
#define BOOT_LED_PIN  GPIO_Pin_4
#define HB_LED_PORT   GPIOC
#define HB_LED_PIN    GPIO_Pin_5
#define HEATER_PORT   GPIOC
#define HEATER_PIN    GPIO_Pin_6
#define FAN_PORT      GPIOC
#define FAN_PIN       GPIO_Pin_7
#define DOOR_PORT     GPIOC
#define DOOR_PIN      GPIO_Pin_3
#define FAN_STAT_PORT GPIOA
#define FAN_STAT_PIN  GPIO_Pin_1
#define PWR_STAT_PORT GPIOA
#define PWR_STAT_PIN  GPIO_Pin_2
#define I2C_PORT     GPIOC
#define I2C_SDA_PIN  GPIO_Pin_1
#define I2C_SCL_PIN  GPIO_Pin_2
#define ARGB_LED_COUNT 1U

#define BUS_UART_BAUD 460800U
#define SOF0 0x55U
#define SOF1 0xAAU
#define BUS_RX_MAX_PAYLOAD 96U
#define BUS_UART_RX_RING 128U
#define BUS_UART_RX_MASK (BUS_UART_RX_RING - 1U)

#define CMD_DISCOVER      0x00U
#define CMD_PING          0x01U
#define CMD_ENTER_BOOT    0x22U
#define CMD_GET_VERSION   0x30U
#define CMD_HEATER_STATUS 0x50U
#define CMD_HEATER_START  0x51U
#define CMD_HEATER_STOP   0x52U
#define CMD_HEATER_CLEAR_ERROR 0x53U
#define CMD_HB            0x70U

#define ST_OK        0x00U
#define ST_BAD_CMD   0x01U
#define ST_BAD_ARG   0x02U
#define ST_IO_ERR    0x04U
#define ST_NOT_READY 0x06U

#define HOST_TIMEOUT_MS 5000U
#define CONTROL_MS 250U
#define STATUS_SAMPLE_MS 2000U
#define DISPLAY_UPDATE_MS 1000U
#define AIR_SAMPLE_MS 5000U
#define OLED_ADDR 0x3CU
#define OLED_W 128U
#define OLED_H 32U
#define OLED_PAGES 4U
#define HEATER_WINDOW_MS 10000U
#define FAN_PWM_PERIOD 2399U
#define FAN_DRY_PWM 2100U
#define FAN_COOL_PWM 1800U
#define FAN_TACH_SAMPLE_MS 1000U
#define FAN_TACH_PULSES_PER_REV 2U
#define FAN_TACH_MIN_PWM_BYTE 20U
#define FAN_TACH_FAIL_MS 3000U
#define FAN_TACH_FULL_RPM 5000U
#define FAN_TACH_LOW_RATIO_PCT 35U
#define SOFTSTART_MS 30000U
#define TEMP_UNAVAILABLE 0x7FFF
#define HUM_UNAVAILABLE 0xFFFFU
#define NTC_ADC_MAX_COUNTS 4095U
#define NTC_ADC_MAX 4095.0f
#define NTC_ADC_REF_MV 3300.0f
#define NTC_SUPPLY_MV 3300.0f
#define NTC_FIXED_OHM 10000.0f
#define NTC_R0_OHM 10000.0f
#define NTC_BETA_K 3590.0f
#define NTC_T0_K 298.15f
#define NTC_HIGH_SIDE 0
#define HEATER_NTC_PARALLEL_OHM 100000.0f
#define HEATER_NTC_MISSING_RATIO 0.90f
#define HEATER_NTC_MISSING_RAW_MAX 1500U

enum {
    DRY_IDLE = 0,
    DRY_DRYING = 1,
    DRY_COOLDOWN = 2,
    DRY_ERROR = 3
};

enum {
    ERR_FAN = 1U << 0,
    ERR_HEATER_OVERHEAT = 1U << 1,
    ERR_DOOR_OPEN = 1U << 2,
    ERR_PCB_OVERHEAT = 1U << 3,
    ERR_NTC = 1U << 4,
    ERR_MASTER_LOST = 1U << 5,
    ERR_AIR_SENSOR = 1U << 6
};

enum {
    WARN_AIR_SENSOR = 1U << 0,
    WARN_HEATER_HOT = 1U << 1,
    WARN_FAN = 1U << 2,
    WARN_DOOR_OPEN = 1U << 3
};

static volatile uint32_t g_tick;
static uint8_t g_registered;
static uint32_t g_last_host_tick;
static uint32_t g_last_hb_blink_tick;
static uint8_t g_hb_led_on;
static uint32_t g_last_control_tick;
static uint32_t g_last_sample_tick;
static uint32_t g_last_air_sample_tick;
static uint32_t g_last_display_tick;
static uint32_t g_window_start_tick;
static uint32_t g_dry_start_tick;
static uint32_t g_dry_duration_ms;
static uint8_t g_state = DRY_IDLE;
static uint8_t g_target_temp_c;
static uint16_t g_time_left_min;
static uint16_t g_error_bits;
static uint16_t g_warn_bits;
static int16_t g_pcb_temp_c10 = TEMP_UNAVAILABLE;
static int16_t g_heater_temp_c10 = TEMP_UNAVAILABLE;
static int16_t g_air_temp_c10 = TEMP_UNAVAILABLE;
static uint16_t g_humidity_rh10 = HUM_UNAVAILABLE;
static uint16_t g_pcb_adc_raw;
static uint16_t g_heater_adc_raw;
static uint8_t g_heater_output_pct;
static uint8_t g_fan_pwm_byte;
static volatile uint32_t g_fan_tach_edges;
static uint32_t g_last_fan_tach_tick;
static uint32_t g_last_fan_tach_edges;
static uint32_t g_last_fan_cmd_tick;
static uint16_t g_fan_rpm;
static uint16_t g_fan_min_rpm;
static volatile uint32_t g_argb[ARGB_LED_COUNT];
static uint8_t g_argb_fault;
static uint8_t g_air_sensor_type; /* 0=none, 1=SHT40, 2=AHT20 */
static uint8_t g_oled_ok;
static uint8_t g_oled[OLED_W * OLED_PAGES];
static uint8_t g_argb_update_pending;
static uint8_t g_display_dirty = 1U;
static uint8_t g_display_last_colon = 0xFFU;
static int16_t g_display_last_air_temp_c10 = TEMP_UNAVAILABLE;
static uint16_t g_display_last_humidity_rh10 = HUM_UNAVAILABLE;
static uint32_t g_display_last_time_s = 0xFFFFFFFFUL;
static volatile uint8_t g_bus_rx_buf[BUS_UART_RX_RING];
static volatile uint8_t g_bus_rx_head;
static volatile uint8_t g_bus_rx_tail;

void SysTick_Handler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void SysTick_Handler(void) { g_tick++; SysTick->SR = 0; }

