mengxyz/PN0031/app/ch32_v006_rewinder/src/main_heater.c
void USART1_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void USART1_IRQHandler(void)
{
    while ((USART1->STATR & USART_FLAG_RXNE) != 0U) {
        uint8_t next;
        uint8_t b = (uint8_t)(USART1->DATAR & 0xFFU);
        next = (uint8_t)((g_bus_rx_head + 1U) & BUS_UART_RX_MASK);
        if (next != g_bus_rx_tail) {
            g_bus_rx_buf[g_bus_rx_head] = b;
            g_bus_rx_head = next;
        }
    }
}

void EXTI7_0_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI7_0_IRQHandler(void)
{
    if ((EXTI->INTFR & EXTI_Line1) != 0U) {
        g_fan_tach_edges++;
        EXTI->INTFR = EXTI_Line1;
    }
}

static void put_u16le(uint8_t *p, uint16_t v) { p[0]=(uint8_t)v; p[1]=(uint8_t)(v>>8); }
static uint16_t get_u16le(const uint8_t *p) { return (uint16_t)p[0] | ((uint16_t)p[1] << 8); }
static void put_i16le(uint8_t *p, int16_t v) { put_u16le(p, (uint16_t)v); }

static void led_set(GPIO_TypeDef *port, uint16_t pin, bool on)
{
    if (on) GPIO_SetBits(port, pin);
    else GPIO_ResetBits(port, pin);
}

uint32_t WS2812BLEDCallback(int ledno)
{
    return (ledno == 0) ? g_argb[0] : 0U;
}

static void argb_flush(void)
{
    uint32_t ctlr = SysTick->CTLR;
    uint32_t guard;

    if (g_argb_fault) return;

    SysTick->CTLR = 0U;

    guard = 60000U;
    while (WS2812BLEDInUse && --guard) {}
    if (!guard) {
        SysTick->CTLR = ctlr;
        g_argb_fault = 1U;
        return;
    }

    WS2812BDMAStart(ARGB_LED_COUNT);

    guard = 60000U;
    while (WS2812BLEDInUse && --guard) {}
    if (!guard) {
        g_argb_fault = 1U;
    }

    SysTick->CTLR = ctlr;
}

static void argb_set(uint8_t r, uint8_t g, uint8_t b)
{
    g_argb[0] = ((uint32_t)b << 16) | ((uint32_t)g << 8) | r;
}

static void argb_status_update(void)
{
    if (g_registered) argb_set(0U, 12U, 0U);
    else argb_set(12U, 0U, 0U);
    argb_flush();
}

static void request_argb_update(void)
{
    g_argb_update_pending = 1U;
}

static void gpio_init_all(void)
{
    GPIO_InitTypeDef g = {0};
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOA | RCC_PB2Periph_GPIOC | RCC_PB2Periph_GPIOD | RCC_PB2Periph_AFIO, ENABLE);

    g.GPIO_Speed = GPIO_Speed_30MHz;
    g.GPIO_Mode = GPIO_Mode_Out_PP;
    g.GPIO_Pin = BOOT_LED_PIN | HB_LED_PIN | HEATER_PIN;
    GPIO_Init(GPIOC, &g);
    led_set(BOOT_LED_PORT, BOOT_LED_PIN, false);
    led_set(HB_LED_PORT, HB_LED_PIN, false);
    led_set(HEATER_PORT, HEATER_PIN, false);

    g.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    g.GPIO_Pin = DOOR_PIN;
    GPIO_Init(DOOR_PORT, &g);
    g.GPIO_Mode = GPIO_Mode_IPU;
    g.GPIO_Pin = FAN_STAT_PIN;
    GPIO_Init(FAN_STAT_PORT, &g);
    g.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    g.GPIO_Pin = PWR_STAT_PIN;
    GPIO_Init(PWR_STAT_PORT, &g);

    g.GPIO_Mode = GPIO_Mode_AIN;
    g.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
    GPIO_Init(GPIOD, &g);

    g.GPIO_Mode = GPIO_Mode_Out_OD;
    g.GPIO_Pin = I2C_SDA_PIN | I2C_SCL_PIN;
    GPIO_Init(I2C_PORT, &g);
    GPIO_SetBits(I2C_PORT, I2C_SDA_PIN | I2C_SCL_PIN);
}

static void fan_tach_init(void)
{
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource1);
    EXTI->INTENR |= EXTI_Line1;
    EXTI->EVENR &= (uint32_t)~EXTI_Line1;
    EXTI->RTENR &= (uint32_t)~EXTI_Line1;
    EXTI->FTENR |= EXTI_Line1;
    EXTI->INTFR = EXTI_Line1;
    NVIC_EnableIRQ(EXTI7_0_IRQn);
}

static void fan_pwm_init(void)
{
    GPIO_InitTypeDef gpio = {0};
    TIM_TimeBaseInitTypeDef tb = {0};
    TIM_OCInitTypeDef oc = {0};
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOC | RCC_PB2Periph_AFIO | RCC_PB2Periph_TIM1, ENABLE);
    GPIO_PinRemapConfig(GPIO_PartialRemap7_TIM1, ENABLE);
    gpio.GPIO_Pin = FAN_PIN;
    gpio.GPIO_Speed = GPIO_Speed_30MHz;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(FAN_PORT, &gpio);
    tb.TIM_Period = FAN_PWM_PERIOD;
    tb.TIM_Prescaler = 0;
    tb.TIM_ClockDivision = TIM_CKD_DIV1;
    tb.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM1, &tb);
    oc.TIM_OCMode = TIM_OCMode_PWM1;
    oc.TIM_OutputState = TIM_OutputState_Enable;
    oc.TIM_Pulse = 0;
    oc.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC4Init(TIM1, &oc);
    TIM_OC4PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(TIM1, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);
    TIM_Cmd(TIM1, ENABLE);
}

static void fan_set_pwm(uint16_t ccr)
{
    uint8_t pwm_byte;
    if (ccr > FAN_PWM_PERIOD) ccr = FAN_PWM_PERIOD;
    TIM1->CH4CVR = ccr;
    pwm_byte = (uint8_t)((uint32_t)ccr * 255U / FAN_PWM_PERIOD);
    if ((pwm_byte == 0U && g_fan_pwm_byte != 0U) || (pwm_byte != 0U && g_fan_pwm_byte == 0U)) {
        g_last_fan_cmd_tick = g_tick;
    }
    g_fan_pwm_byte = pwm_byte;
}

static void adc_init_simple(void)
{
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_ADC1, ENABLE);
    RCC_ADCCLKConfig(RCC_PCLK2_Div8);
    ADC1->SAMPTR2 = ADC_SMP3 | ADC_SMP4;
    ADC1->RSQR1 = 0U;
    ADC1->RSQR2 = 0U;
    ADC1->RSQR3 = 0U;
    ADC1->CTLR2 = ADC_ADON | ADC_EXTTRIG;
}

static uint16_t adc_read_once(uint8_t ch)
{
    uint32_t t = 100000U;
    ADC1->RSQR1 = 0U;
    ADC1->RSQR2 = 0U;
    ADC1->RSQR3 = (uint32_t)(ch & ADC_SQ1);
    for (volatile uint16_t settle = 0U; settle < 120U; ++settle) {}
    ADC1->STATR = 0U;
    ADC1->CTLR2 |= ADC_SWSTART;
    while (((ADC1->STATR & ADC_EOC) == 0U) && --t) {}
    if (t == 0U) return 0U;
    return (uint16_t)(ADC1->RDATAR & NTC_ADC_MAX_COUNTS);
}

static uint16_t adc_read(uint8_t ch)
{
    uint32_t sum = 0U;
    (void)adc_read_once(ch);
    for (uint8_t i = 0U; i < 4U; ++i) {
        sum += adc_read_once(ch);
    }
    return (uint16_t)((sum + 2U) / 4U);
}

static int16_t ntc_resistance_to_c10(float r_ntc)
{
    float inv_t, c;
    int32_t c10;
    if (r_ntc <= 0.0f) return TEMP_UNAVAILABLE;
    inv_t = (1.0f / NTC_T0_K) + (logf(r_ntc / NTC_R0_OHM) / NTC_BETA_K);
    c = (1.0f / inv_t) - 273.15f;
    if (c < -40.0f) c = -40.0f;
    if (c > 150.0f) c = 150.0f;
    c10 = (int32_t)((c * 10.0f) + (c >= 0.0f ? 0.5f : -0.5f));
    return (int16_t)c10;
}

static float ntc_raw_to_resistance(uint16_t raw)
{
    float v_adc;
    if (raw < 2U || raw >= NTC_ADC_MAX_COUNTS) return 0.0f;
    v_adc = ((float)raw * NTC_ADC_REF_MV) / NTC_ADC_MAX;
    if (v_adc <= 0.0f || v_adc >= NTC_SUPPLY_MV) return 0.0f;
#if NTC_HIGH_SIDE
    /* GND -- fixed resistor -- ADC -- NTC -- VCC */
    return NTC_FIXED_OHM * (NTC_SUPPLY_MV - v_adc) / v_adc;
#else
    /* GND -- NTC -- ADC -- fixed resistor -- VCC */
    return NTC_FIXED_OHM * v_adc / (NTC_SUPPLY_MV - v_adc);
#endif
}

