mengxyz/PN0031/app/ch32_v006_rewinder/src/main_heater.c
static int16_t ntc_raw_to_c10(uint16_t raw)
{
    return ntc_resistance_to_c10(ntc_raw_to_resistance(raw));
}

static int16_t heater_ntc_raw_to_c10(uint16_t raw)
{
    float r_eq = ntc_raw_to_resistance(raw);
    float r_ntc;
    if (raw <= HEATER_NTC_MISSING_RAW_MAX) return TEMP_UNAVAILABLE;
    if (r_eq <= 0.0f) return TEMP_UNAVAILABLE;
    if (r_eq >= (HEATER_NTC_PARALLEL_OHM * HEATER_NTC_MISSING_RATIO)) return TEMP_UNAVAILABLE;
    r_ntc = (r_eq * HEATER_NTC_PARALLEL_OHM) / (HEATER_NTC_PARALLEL_OHM - r_eq);
    return ntc_resistance_to_c10(r_ntc);
}

static uint8_t door_open(void) { return (GPIO_ReadInputDataBit(DOOR_PORT, DOOR_PIN) == 0U) ? 1U : 0U; }
static void fan_tach_task(void)
{
    uint32_t now = g_tick;
    uint32_t elapsed = now - g_last_fan_tach_tick;
    uint32_t edges;
    uint32_t delta;
    uint32_t rpm;
    uint32_t expected;

    if (elapsed < FAN_TACH_SAMPLE_MS) return;
    edges = g_fan_tach_edges;
    delta = edges - g_last_fan_tach_edges;
    g_last_fan_tach_edges = edges;
    g_last_fan_tach_tick = now;

    if (FAN_TACH_PULSES_PER_REV == 0U || elapsed == 0U) rpm = 0U;
    else rpm = (delta * 60000UL) / ((uint32_t)FAN_TACH_PULSES_PER_REV * elapsed);
    if (rpm > 65535UL) rpm = 65535UL;
    g_fan_rpm = (uint16_t)rpm;

    expected = ((uint32_t)g_fan_pwm_byte * FAN_TACH_FULL_RPM) / 255UL;
    expected = (expected * FAN_TACH_LOW_RATIO_PCT) / 100UL;
    if (g_fan_pwm_byte < FAN_TACH_MIN_PWM_BYTE) expected = 0UL;
    if (expected > 65535UL) expected = 65535UL;
    g_fan_min_rpm = (uint16_t)expected;
}

static uint8_t fan_ok(void)
{
    if (g_fan_pwm_byte < FAN_TACH_MIN_PWM_BYTE) return 1U;
    if ((g_tick - g_last_fan_cmd_tick) < FAN_TACH_FAIL_MS) return 1U;
    return (g_fan_rpm >= g_fan_min_rpm && g_fan_rpm != 0U) ? 1U : 0U;
}
static uint8_t power_ok(void) { return (GPIO_ReadInputDataBit(PWR_STAT_PORT, PWR_STAT_PIN) != 0U) ? 1U : 0U; }

static void i2c_delay(void) { for (volatile uint16_t d = 0U; d < 60U; d++) {} }
static void busy_delay_ms(uint16_t ms) { while (ms--) for (volatile uint32_t d = 0U; d < 12000U; d++) {} }
static void i2c_sda(bool high) { if (high) GPIO_SetBits(I2C_PORT, I2C_SDA_PIN); else GPIO_ResetBits(I2C_PORT, I2C_SDA_PIN); }
static void i2c_scl(bool high) { if (high) GPIO_SetBits(I2C_PORT, I2C_SCL_PIN); else GPIO_ResetBits(I2C_PORT, I2C_SCL_PIN); }
static uint8_t i2c_sda_read(void) { return GPIO_ReadInputDataBit(I2C_PORT, I2C_SDA_PIN) ? 1U : 0U; }

static void i2c_start(void)
{
    i2c_sda(true); i2c_scl(true); i2c_delay();
    i2c_sda(false); i2c_delay(); i2c_scl(false); i2c_delay();
}

static void i2c_stop(void)
{
    i2c_sda(false); i2c_delay(); i2c_scl(true); i2c_delay(); i2c_sda(true); i2c_delay();
}

static bool i2c_write_byte(uint8_t b)
{
    uint8_t i, ack;
    for (i = 0U; i < 8U; i++) {
        i2c_sda((b & 0x80U) != 0U); i2c_delay(); i2c_scl(true); i2c_delay(); i2c_scl(false); b <<= 1;
    }
    i2c_sda(true); i2c_delay(); i2c_scl(true); i2c_delay(); ack = (uint8_t)!i2c_sda_read(); i2c_scl(false); i2c_delay();
    return ack != 0U;
}

static uint8_t i2c_read_byte(bool ack)
{
    uint8_t i, b = 0U;
    i2c_sda(true);
    for (i = 0U; i < 8U; i++) {
        b <<= 1; i2c_scl(true); i2c_delay(); if (i2c_sda_read()) b |= 1U; i2c_scl(false); i2c_delay();
    }
    i2c_sda(!ack); i2c_delay(); i2c_scl(true); i2c_delay(); i2c_scl(false); i2c_sda(true);
    return b;
}

static bool i2c_probe(uint8_t addr)
{
    bool ok;
    i2c_start();
    ok = i2c_write_byte((uint8_t)(addr << 1));
    i2c_stop();
    return ok;
}

static bool oled_cmd(uint8_t cmd)
{
    i2c_start();
    if (!i2c_write_byte(OLED_ADDR << 1) || !i2c_write_byte(0x00U) || !i2c_write_byte(cmd)) { i2c_stop(); return false; }
    i2c_stop();
    return true;
}

static bool oled_data_chunk(const uint8_t *data, uint8_t len)
{
    uint8_t i;
    i2c_start();
    if (!i2c_write_byte(OLED_ADDR << 1) || !i2c_write_byte(0x40U)) { i2c_stop(); return false; }
    for (i = 0U; i < len; i++) {
        if (!i2c_write_byte(data[i])) { i2c_stop(); return false; }
    }
    i2c_stop();
    return true;
}

static void oled_clear_buf(void)
{
    memset(g_oled, 0, sizeof(g_oled));
}

static uint8_t font5(char c, uint8_t col)
{
    static const uint8_t digits[10][5] = {
        {0x3E,0x51,0x49,0x45,0x3E}, {0x00,0x42,0x7F,0x40,0x00},
        {0x42,0x61,0x51,0x49,0x46}, {0x21,0x41,0x45,0x4B,0x31},
        {0x18,0x14,0x12,0x7F,0x10}, {0x27,0x45,0x45,0x45,0x39},
        {0x3C,0x4A,0x49,0x49,0x30}, {0x01,0x71,0x09,0x05,0x03},
        {0x36,0x49,0x49,0x49,0x36}, {0x06,0x49,0x49,0x29,0x1E}
    };
    uint8_t g[5] = {0,0,0,0,0};
    if (c >= '0' && c <= '9') return digits[c - '0'][col];
    switch (c) {
    case 'A': { uint8_t t[5]={0x7E,0x11,0x11,0x11,0x7E}; memcpy(g,t,5); break; }
    case 'B': { uint8_t t[5]={0x7F,0x49,0x49,0x49,0x36}; memcpy(g,t,5); break; }
    case 'C': { uint8_t t[5]={0x3E,0x41,0x41,0x41,0x22}; memcpy(g,t,5); break; }
    case 'D': { uint8_t t[5]={0x7F,0x41,0x41,0x22,0x1C}; memcpy(g,t,5); break; }
    case 'E': { uint8_t t[5]={0x7F,0x49,0x49,0x49,0x41}; memcpy(g,t,5); break; }
    case 'F': { uint8_t t[5]={0x7F,0x09,0x09,0x09,0x01}; memcpy(g,t,5); break; }
    case 'G': { uint8_t t[5]={0x3E,0x41,0x49,0x49,0x7A}; memcpy(g,t,5); break; }
    case 'H': { uint8_t t[5]={0x7F,0x08,0x08,0x08,0x7F}; memcpy(g,t,5); break; }
    case 'U': { uint8_t t[5]={0x3F,0x40,0x40,0x40,0x3F}; memcpy(g,t,5); break; }
    case 'I': { uint8_t t[5]={0x00,0x41,0x7F,0x41,0x00}; memcpy(g,t,5); break; }
    case 'L': { uint8_t t[5]={0x7F,0x40,0x40,0x40,0x40}; memcpy(g,t,5); break; }
    case 'M': { uint8_t t[5]={0x7F,0x02,0x0C,0x02,0x7F}; memcpy(g,t,5); break; }
    case 'N': { uint8_t t[5]={0x7F,0x04,0x08,0x10,0x7F}; memcpy(g,t,5); break; }
    case 'O': { uint8_t t[5]={0x3E,0x41,0x41,0x41,0x3E}; memcpy(g,t,5); break; }
    case 'P': { uint8_t t[5]={0x7F,0x09,0x09,0x09,0x06}; memcpy(g,t,5); break; }
    case 'R': { uint8_t t[5]={0x7F,0x09,0x19,0x29,0x46}; memcpy(g,t,5); break; }
    case 'S': { uint8_t t[5]={0x46,0x49,0x49,0x49,0x31}; memcpy(g,t,5); break; }
    case 'T': { uint8_t t[5]={0x01,0x01,0x7F,0x01,0x01}; memcpy(g,t,5); break; }
    case 'Y': { uint8_t t[5]={0x07,0x08,0x70,0x08,0x07}; memcpy(g,t,5); break; }
    case '.': { uint8_t t[5]={0x00,0x60,0x60,0x00,0x00}; memcpy(g,t,5); break; }
    case ':': { uint8_t t[5]={0x00,0x36,0x36,0x00,0x00}; memcpy(g,t,5); break; }
    case '-': { uint8_t t[5]={0x08,0x08,0x08,0x08,0x08}; memcpy(g,t,5); break; }
    case '%': { uint8_t t[5]={0x62,0x64,0x08,0x13,0x23}; memcpy(g,t,5); break; }
    case '|': { uint8_t t[5]={0x00,0x00,0x7F,0x00,0x00}; memcpy(g,t,5); break; }
    case ' ': default: break;
    }
    return g[col];
}

