mengxyz/PN0031/app/ch32_v006_rewinder/src/main_heater.c
static void oled_pixel(uint8_t x, uint8_t y, bool on)
{
    uint16_t idx;
    uint8_t mask;
    if (x >= OLED_W || y >= OLED_H) return;
    idx = (uint16_t)((uint16_t)(y >> 3U) * OLED_W + x);
    mask = (uint8_t)(1U << (y & 7U));
    if (on) g_oled[idx] |= mask;
    else g_oled[idx] &= (uint8_t)~mask;
}

static void oled_draw_char_xy(uint8_t x, uint8_t y, char c)
{
    uint8_t col, row, bits;
    if (x > (OLED_W - 6U) || y > (OLED_H - 7U)) return;
    for (col = 0U; col < 5U; col++) {
        bits = font5(c, col);
        for (row = 0U; row < 7U; row++) {
            oled_pixel((uint8_t)(x + col), (uint8_t)(y + row), (bits & (1U << row)) != 0U);
        }
    }
}

static void oled_draw_text_xy(uint8_t x, uint8_t y, const char *s)
{
    while (*s && x <= (OLED_W - 6U)) {
        oled_draw_char_xy(x, y, *s++);
        x = (uint8_t)(x + 6U);
    }
}

static void oled_draw_char_bold_xy(uint8_t x, uint8_t y, char c)
{
    uint8_t col, row, bits;
    if (x > (OLED_W - 7U) || y > (OLED_H - 8U)) return;
    for (col = 0U; col < 5U; col++) {
        bits = font5(c, col);
        for (row = 0U; row < 7U; row++) {
            if ((bits & (1U << row)) == 0U) continue;
            oled_pixel((uint8_t)(x + col), (uint8_t)(y + row), true);
            oled_pixel((uint8_t)(x + col + 1U), (uint8_t)(y + row), true);
            oled_pixel((uint8_t)(x + col), (uint8_t)(y + row + 1U), true);
        }
    }
}

static void oled_draw_digit_compact_scaled(uint8_t x, uint8_t y, uint8_t d, uint8_t scale)
{
    static const uint8_t glyph[10][3] = {
        {0x1F,0x11,0x1F}, {0x00,0x1F,0x00}, {0x1D,0x15,0x17}, {0x15,0x15,0x1F},
        {0x07,0x04,0x1F}, {0x17,0x15,0x1D}, {0x1F,0x15,0x1D}, {0x01,0x01,0x1F},
        {0x1F,0x15,0x1F}, {0x17,0x15,0x1F}
    };
    uint8_t col, row, xx, yy, bits;
    d %= 10U;
    if (scale < 1U) scale = 1U;
    for (col = 0U; col < 3U; col++) {
        bits = glyph[d][col];
        for (row = 0U; row < 5U; row++) {
            if ((bits & (1U << row)) == 0U) continue;
            for (xx = 0U; xx < scale; xx++) {
                for (yy = 0U; yy < scale; yy++) {
                    oled_pixel((uint8_t)(x + (col * scale) + xx), (uint8_t)(y + (row * scale) + yy), true);
                }
            }
        }
    }
}

static void oled_draw_digit_compact2(uint8_t x, uint8_t y, uint8_t d)
{
    oled_draw_digit_compact_scaled(x, y, d, 2U);
}

static void oled_draw_colon_compact2(uint8_t x, uint8_t y)
{
    oled_pixel(x, (uint8_t)(y + 2U), true);
    oled_pixel(x, (uint8_t)(y + 3U), true);
    oled_pixel((uint8_t)(x + 1U), (uint8_t)(y + 2U), true);
    oled_pixel((uint8_t)(x + 1U), (uint8_t)(y + 3U), true);
    oled_pixel(x, (uint8_t)(y + 7U), true);
    oled_pixel(x, (uint8_t)(y + 8U), true);
    oled_pixel((uint8_t)(x + 1U), (uint8_t)(y + 7U), true);
    oled_pixel((uint8_t)(x + 1U), (uint8_t)(y + 8U), true);
}

static uint8_t oled_draw_u16_compact_scaled(uint8_t x, uint8_t y, uint16_t v, uint8_t scale)
{
    char tmp[5];
    uint8_t n = 0U;
    uint8_t step = (uint8_t)((3U * scale) + 1U);
    if (v == 0U) {
        oled_draw_digit_compact_scaled(x, y, 0U, scale);
        return (uint8_t)(x + step);
    }
    while (v && n < sizeof(tmp)) { tmp[n++] = (char)(v % 10U); v = (uint16_t)(v / 10U); }
    while (n) {
        oled_draw_digit_compact_scaled(x, y, (uint8_t)tmp[--n], scale);
        x = (uint8_t)(x + step);
    }
    return x;
}

static uint8_t compact_u16_width_scaled(uint16_t v, uint8_t scale)
{
    uint8_t digits = 1U;
    uint8_t step = (uint8_t)((3U * scale) + 1U);
    while (v >= 10U) {
        digits++;
        v = (uint16_t)(v / 10U);
    }
    return (uint8_t)(digits * step);
}

static uint32_t display_time_left_s(void)
{
    if (g_state != DRY_DRYING && g_state != DRY_COOLDOWN) return 0U;
    if ((g_tick - g_dry_start_tick) >= g_dry_duration_ms) return 0U;
    return (g_dry_duration_ms - (g_tick - g_dry_start_tick) + 999UL) / 1000UL;
}

static uint8_t center_x(uint8_t left, uint8_t right, uint8_t w)
{
    uint8_t col_w = (uint8_t)(right - left + 1U);
    if (w >= col_w) return left;
    return (uint8_t)(left + ((col_w - w) / 2U));
}

static void display_draw_c10_value(uint8_t left, uint8_t right, uint8_t y, int16_t v, char unit)
{
    int16_t rounded;
    bool neg = false;
    uint8_t x, tx, w;
    uint8_t scale = 2U;
    if (v == TEMP_UNAVAILABLE) {
        x = center_x(left, right, 6U);
        oled_draw_char_bold_xy(x, (uint8_t)(y + 2U), '-');
        return;
    }
    if (v < 0) {
        neg = true;
        v = (int16_t)-v;
    }
    rounded = (int16_t)((v + 5) / 10);
    w = (uint8_t)(compact_u16_width_scaled((uint16_t)rounded, scale) + 7U + (neg ? 6U : 0U));
    x = center_x(left, right, w);
    if (neg) {
        oled_draw_text_xy(x, (uint8_t)(y + 5U), "-");
        x = (uint8_t)(x + 6U);
    }
    tx = oled_draw_u16_compact_scaled(x, y, (uint16_t)rounded, scale);
    oled_draw_char_bold_xy((uint8_t)(tx + 1U), (uint8_t)(y + 2U), unit);
}

static void display_draw_rh_value(uint8_t left, uint8_t right, uint8_t y, uint16_t v)
{
    uint8_t x, tx, w;
    uint16_t rounded;
    uint8_t scale = 2U;
    if (v == HUM_UNAVAILABLE) {
        x = center_x(left, right, 6U);
        oled_draw_char_bold_xy(x, (uint8_t)(y + 2U), '-');
        return;
    }
    rounded = (uint16_t)((v + 5U) / 10U);
    w = (uint8_t)(compact_u16_width_scaled(rounded, scale) + 7U);
    x = center_x(left, right, w);
    tx = oled_draw_u16_compact_scaled(x, y, rounded, scale);
    oled_draw_char_bold_xy((uint8_t)(tx + 1U), (uint8_t)(y + 2U), '%');
}

static void display_draw_time(uint8_t left, uint8_t right, uint8_t y, uint32_t seconds)
{
    uint8_t x;
    uint16_t h = (uint16_t)(seconds / 3600UL);
    uint16_t m = (uint16_t)((seconds / 60UL) % 60UL);
    uint16_t s = (uint16_t)(seconds % 60UL);
    bool colon_on = (((g_tick / 1000UL) & 1UL) != 0UL);
    if (h > 99U) h = 99U;
    x = center_x(left, right, 48U);
    oled_draw_digit_compact2(x, y, (uint8_t)(h / 10U)); x = (uint8_t)(x + 7U);
    oled_draw_digit_compact2(x, y, (uint8_t)(h % 10U)); x = (uint8_t)(x + 7U);
    if (colon_on) oled_draw_colon_compact2(x, y);
    x = (uint8_t)(x + 3U);
    oled_draw_digit_compact2(x, y, (uint8_t)(m / 10U)); x = (uint8_t)(x + 7U);
    oled_draw_digit_compact2(x, y, (uint8_t)(m % 10U)); x = (uint8_t)(x + 7U);
    if (colon_on) oled_draw_colon_compact2(x, y);
    x = (uint8_t)(x + 3U);
    oled_draw_digit_compact2(x, y, (uint8_t)(s / 10U)); x = (uint8_t)(x + 7U);
    oled_draw_digit_compact2(x, y, (uint8_t)(s % 10U));
}

static bool oled_flush(void)
{
    uint16_t off;
    if (!oled_cmd(0x21U) || !oled_cmd(0U) || !oled_cmd(OLED_W - 1U)) return false;
    if (!oled_cmd(0x22U) || !oled_cmd(0U) || !oled_cmd(OLED_PAGES - 1U)) return false;
    for (off = 0U; off < sizeof(g_oled); off = (uint16_t)(off + 16U)) {
        if (!oled_data_chunk(&g_oled[off], 16U)) return false;
    }
    return true;
}

