mengxyz/PN0031/app/ch32_v006_rewinder/src/main_heater.c
static bool oled_init(void)
{
    static const uint8_t init[] = {
        0xAE,       /* display off */
        0xD5,0x80,  /* clock */
        0xA8,0x1F,  /* multiplex 1/32 */
        0xD3,0x00,  /* offset */
        0x40,       /* start line */
        0x8D,0x14,  /* charge pump */
        0x20,0x00,  /* horizontal addressing */
        0xA1,       /* segment remap */
        0xC8,       /* COM scan dec */
        0xDA,0x02,  /* COM pins for 128x32 */
        0x81,0x8F,  /* contrast */
        0xD9,0xF1,  /* precharge */
        0xDB,0x40,  /* vcom */
        0xA4,       /* resume RAM */
        0xA6,       /* normal */
        0x2E,       /* scroll off */
        0xAF        /* display on */
    };
    uint8_t i;
    busy_delay_ms(50U);
    if (!i2c_probe(OLED_ADDR)) return false;
    for (i = 0U; i < sizeof(init); i++) {
        if (!oled_cmd(init[i])) return false;
    }
    oled_clear_buf();
    return oled_flush();
}

static void display_task(bool force)
{
    uint8_t colon;
    uint32_t time_s;
    if (!g_oled_ok) return;
    colon = (uint8_t)((g_tick / 1000UL) & 1UL);
    time_s = display_time_left_s();
    if (g_air_temp_c10 != g_display_last_air_temp_c10 ||
        g_humidity_rh10 != g_display_last_humidity_rh10 ||
        time_s != g_display_last_time_s ||
        colon != g_display_last_colon) {
        g_display_dirty = 1U;
    }
    if (!force && !g_display_dirty) return;
    if (!force && (g_tick - g_last_display_tick) < DISPLAY_UPDATE_MS) return;
    g_last_display_tick = g_tick;
    g_display_dirty = 0U;
    g_display_last_colon = colon;
    g_display_last_air_temp_c10 = g_air_temp_c10;
    g_display_last_humidity_rh10 = g_humidity_rh10;
    g_display_last_time_s = time_s;
    oled_clear_buf();

    oled_draw_text_xy(8U, 0U, "TEM");
    oled_draw_text_xy(45U, 0U, "HUMI");
    oled_draw_text_xy(90U, 0U, "TIME");

    display_draw_c10_value(1U, 38U, 15U, g_air_temp_c10, 'C');
    display_draw_rh_value(40U, 74U, 15U, g_humidity_rh10);
    display_draw_time(76U, 127U, 15U, time_s);

    if (!oled_flush()) g_oled_ok = 0U;
}

static void air_sensor_detect(void)
{
    if (i2c_probe(0x44U)) g_air_sensor_type = 1U;
    else if (i2c_probe(0x38U)) g_air_sensor_type = 2U;
    else g_air_sensor_type = 0U;
}

static bool sht40_read(int16_t *temp_c10, uint16_t *rh10)
{
    uint8_t d[6], i;
    uint16_t raw_t, raw_h;
    i2c_start();
    if (!i2c_write_byte(0x44U << 1) || !i2c_write_byte(0xFD)) { i2c_stop(); return false; }
    i2c_stop();
    for (volatile uint32_t w = 0U; w < 120000U; w++) {}
    i2c_start();
    if (!i2c_write_byte((uint8_t)((0x44U << 1) | 1U))) { i2c_stop(); return false; }
    for (i = 0U; i < 6U; i++) d[i] = i2c_read_byte(i < 5U);
    i2c_stop();
    raw_t = ((uint16_t)d[0] << 8) | d[1];
    raw_h = ((uint16_t)d[3] << 8) | d[4];
    *temp_c10 = (int16_t)((1750L * raw_t) / 65535L - 450L);
    *rh10 = (uint16_t)((1250UL * raw_h) / 65535UL);
    if (*rh10 > 1000U) *rh10 = 1000U;
    return true;
}

static bool aht20_read(int16_t *temp_c10, uint16_t *rh10)
{
    uint8_t d[6], i;
    uint32_t raw_h, raw_t;
    i2c_start();
    if (!i2c_write_byte(0x38U << 1) || !i2c_write_byte(0xAC) || !i2c_write_byte(0x33) || !i2c_write_byte(0x00)) { i2c_stop(); return false; }
    i2c_stop();
    for (volatile uint32_t w = 0U; w < 900000U; w++) {}
    i2c_start();
    if (!i2c_write_byte((uint8_t)((0x38U << 1) | 1U))) { i2c_stop(); return false; }
    for (i = 0U; i < 6U; i++) d[i] = i2c_read_byte(i < 5U);
    i2c_stop();
    if ((d[0] & 0x80U) != 0U) return false;
    raw_h = ((uint32_t)d[1] << 12) | ((uint32_t)d[2] << 4) | ((uint32_t)d[3] >> 4);
    raw_t = (((uint32_t)d[3] & 0x0FU) << 16) | ((uint32_t)d[4] << 8) | d[5];
    *rh10 = (uint16_t)((raw_h * 1000UL) >> 20);
    *temp_c10 = (int16_t)(((int32_t)((raw_t * 2000UL) >> 20)) - 500);
    return true;
}

static void sample_task(bool force)
{
    if (!force && (g_tick - g_last_sample_tick) < STATUS_SAMPLE_MS) return;
    g_last_sample_tick = g_tick;
    g_pcb_adc_raw = adc_read(3U);
    g_heater_adc_raw = adc_read(4U);
    g_pcb_temp_c10 = ntc_raw_to_c10(g_pcb_adc_raw);
    g_heater_temp_c10 = heater_ntc_raw_to_c10(g_heater_adc_raw);
    if (!force && (g_tick - g_last_air_sample_tick) < AIR_SAMPLE_MS) return;
    g_last_air_sample_tick = g_tick;
    if ((g_air_sensor_type == 1U && sht40_read(&g_air_temp_c10, &g_humidity_rh10)) ||
        (g_air_sensor_type == 2U && aht20_read(&g_air_temp_c10, &g_humidity_rh10))) {
        g_warn_bits &= (uint16_t)~WARN_AIR_SENSOR;
    } else {
        g_warn_bits |= WARN_AIR_SENSOR;
        g_air_temp_c10 = TEMP_UNAVAILABLE;
        g_humidity_rh10 = HUM_UNAVAILABLE;
        air_sensor_detect();
    }
}

static bool air_sensor_online(void)
{
    return (g_air_temp_c10 != TEMP_UNAVAILABLE && g_humidity_rh10 != HUM_UNAVAILABLE);
}

static void heater_set(bool on) { led_set(HEATER_PORT, HEATER_PIN, on); }

static void dry_stop(uint16_t err)
{
    heater_set(false);
    g_heater_output_pct = 0U;
    if (err) g_error_bits |= err;
    if (err) g_state = DRY_ERROR;
    else g_state = DRY_COOLDOWN;
    fan_set_pwm(FAN_COOL_PWM);
    request_argb_update();
}

static void bus_mark_master_seen(void)
{
    uint8_t changed = 0U;
    g_last_host_tick = g_tick;
    if ((g_error_bits & ERR_MASTER_LOST) != 0U) {
        g_error_bits &= (uint16_t)~ERR_MASTER_LOST;
        if (g_state == DRY_ERROR && g_error_bits == 0U) g_state = DRY_IDLE;
        changed = 1U;
    }
    if (!g_registered) {
        g_registered = 1U;
        g_last_hb_blink_tick = g_tick;
        g_hb_led_on = 1U;
        led_set(HB_LED_PORT, HB_LED_PIN, true);
        changed = 1U;
    }
    if (changed) request_argb_update();
}

static uint16_t crc16(const uint8_t *data, uint16_t len)
{
    uint16_t crc = 0xFFFFU, i, j;
    for (i = 0U; i < len; i++) {
        crc ^= (uint16_t)data[i] << 8;
        for (j = 0U; j < 8U; j++) crc = (crc & 0x8000U) ? (uint16_t)((crc << 1) ^ 0x1021U) : (uint16_t)(crc << 1);
    }
    return crc;
}

static void bus_uart_init(void)
{
    GPIO_InitTypeDef gpio = {0};
    USART_InitTypeDef uart = {0};
    RCC_PB2PeriphClockCmd(RCC_PB2Periph_GPIOD | RCC_PB2Periph_AFIO | RCC_PB2Periph_USART1, ENABLE);
    GPIO_PinRemapConfig(GPIO_PartialRemap1_USART1, DISABLE);
    gpio.GPIO_Pin = RS485_DE_PIN;
    gpio.GPIO_Speed = GPIO_Speed_30MHz;
    gpio.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(RS485_DE_PORT, &gpio);
    GPIO_ResetBits(RS485_DE_PORT, RS485_DE_PIN);
    gpio.GPIO_Pin = GPIO_Pin_5;
    gpio.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOD, &gpio);
    gpio.GPIO_Pin = GPIO_Pin_6;
    gpio.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOD, &gpio);
    USART_StructInit(&uart);
    uart.USART_BaudRate = BUS_UART_BAUD;
    uart.USART_WordLength = USART_WordLength_8b;
    uart.USART_StopBits = USART_StopBits_1;
    uart.USART_Parity = USART_Parity_No;
    uart.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    uart.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(USART1, &uart);
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
    USART_Cmd(USART1, ENABLE);
    NVIC_EnableIRQ(USART1_IRQn);
    GPIO_PinRemapConfig(GPIO_PartialRemap1_USART1, DISABLE);
}

static void bus_uart_write(const uint8_t *buf, uint16_t len)
{
    uint16_t i;
    GPIO_SetBits(RS485_DE_PORT, RS485_DE_PIN);
    for (volatile uint16_t t = 0U; t < 200U; t++) {}
    for (i = 0U; i < len; i++) {
        while ((USART1->STATR & USART_FLAG_TXE) == 0U) {}
        USART1->DATAR = buf[i];
    }
    while ((USART1->STATR & USART_FLAG_TC) == 0U) {}
    GPIO_ResetBits(RS485_DE_PORT, RS485_DE_PIN);
}

static bool bus_uart_read_byte(uint8_t *out)
{
    if (g_bus_rx_tail == g_bus_rx_head) return false;
    *out = g_bus_rx_buf[g_bus_rx_tail];
    g_bus_rx_tail = (uint8_t)((g_bus_rx_tail + 1U) & BUS_UART_RX_MASK);
    return true;
}

