mengxyz/PN0031/app/ch32_v006_rewinder/src/main_heater.c
static void bus_send(uint8_t cmd, uint8_t seq, const uint8_t *payload, uint16_t plen)
{
    uint8_t frame[9 + BUS_RX_MAX_PAYLOAD];
    uint16_t crc;
    frame[0] = SOF0; frame[1] = SOF1; frame[2] = DEVICE_ADDR; frame[3] = (uint8_t)(cmd | 0x80U); frame[4] = seq;
    put_u16le(&frame[5], plen);
    if (plen) memcpy(&frame[7], payload, plen);
    crc = crc16(&frame[2], (uint16_t)(5U + plen));
    put_u16le(&frame[7 + plen], crc);
    bus_uart_write(frame, (uint16_t)(9U + plen));
}

static void fill_identity(uint8_t *out, uint16_t *out_len)
{
    uint32_t uid0 = UID_WORD0, uid1 = UID_WORD1;
    out[0]=ST_OK; out[1]=DEVICE_TYPE; out[2]=DEVICE_ADDR;
    out[3]=APP_VERSION_MAJOR; out[4]=APP_VERSION_MINOR; out[5]=APP_VERSION_PATCH;
    out[6]=(uint8_t)uid0; out[7]=(uint8_t)(uid0>>8); out[8]=(uint8_t)(uid0>>16); out[9]=(uint8_t)(uid0>>24);
    out[10]=(uint8_t)uid1; out[11]=(uint8_t)(uid1>>8); out[12]=(uint8_t)(uid1>>16); out[13]=(uint8_t)(uid1>>24);
    *out_len = 14U;
}

static void fill_status(uint8_t *out, uint16_t *out_len)
{
    uint8_t p = 0U;
    out[p++] = ST_OK;
    out[p++] = g_state;
    put_u16le(&out[p], g_error_bits); p += 2U;
    put_u16le(&out[p], g_warn_bits); p += 2U;
    put_i16le(&out[p], g_pcb_temp_c10); p += 2U;
    put_i16le(&out[p], g_heater_temp_c10); p += 2U;
    put_i16le(&out[p], g_air_temp_c10); p += 2U;
    put_u16le(&out[p], g_humidity_rh10); p += 2U;
    out[p++] = door_open();
    out[p++] = fan_ok();
    out[p++] = power_ok();
    out[p++] = g_target_temp_c;
    put_u16le(&out[p], g_time_left_min); p += 2U;
    out[p++] = g_heater_output_pct;
    out[p++] = g_fan_pwm_byte;
    put_u16le(&out[p], g_pcb_adc_raw); p += 2U;
    put_u16le(&out[p], g_heater_adc_raw); p += 2U;
    put_u16le(&out[p], g_fan_rpm); p += 2U;
    put_u16le(&out[p], g_fan_min_rpm); p += 2U;
    *out_len = p;
}

static void fill_heater_ack(uint8_t *out, uint16_t *out_len, uint8_t status)
{
    out[0] = status;
    put_u16le(&out[1], g_error_bits);
    put_u16le(&out[3], g_warn_bits);
    *out_len = 5U;
}

static void bus_handle_cmd(uint8_t dest, uint8_t cmd, uint8_t seq, const uint8_t *payload, uint16_t plen)
{
    uint8_t out[BUS_RX_MAX_PAYLOAD];
    uint16_t out_len = 0U;
    bool enter_boot = false;
    if (dest == BROADCAST_ADDR) for (volatile uint32_t d = 0U; d < (uint32_t)DEVICE_ADDR * 96000UL; d++) {}
    switch (cmd) {
    case CMD_DISCOVER:
    case CMD_PING:
    case CMD_GET_VERSION:
        bus_mark_master_seen();
        fill_identity(out, &out_len);
        break;
    case CMD_HEATER_STATUS:
        fill_status(out, &out_len);
        break;
    case CMD_HEATER_START: {
        uint16_t mins;
        if (plen != 3U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        mins = get_u16le(&payload[1]);
        if (payload[0] < 40U || payload[0] > 60U || mins < 1U || mins > 1440U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        bus_mark_master_seen();
        sample_task(true);
        if (!air_sensor_online()) {
            g_error_bits = ERR_AIR_SENSOR;
            fill_heater_ack(out, &out_len, ST_NOT_READY); break;
        }
        if (g_heater_temp_c10 == TEMP_UNAVAILABLE || g_pcb_temp_c10 == TEMP_UNAVAILABLE) {
            g_error_bits = ERR_NTC;
            fill_heater_ack(out, &out_len, ST_NOT_READY); break;
        }
        g_error_bits = 0U; g_warn_bits = 0U; g_target_temp_c = payload[0]; g_time_left_min = mins;
        g_dry_duration_ms = (uint32_t)mins * 60000UL;
        g_dry_start_tick = g_tick; g_window_start_tick = g_tick; g_state = DRY_DRYING;
        fan_set_pwm(FAN_DRY_PWM); request_argb_update(); fill_heater_ack(out, &out_len, ST_OK); break;
    }
    case CMD_HEATER_STOP:
        if (plen != 0U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        dry_stop(0U); out[0]=ST_OK; out_len=1U; break;
    case CMD_HEATER_CLEAR_ERROR:
        if (plen != 0U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        g_error_bits = 0U; g_warn_bits = 0U; if (g_state == DRY_ERROR) g_state = DRY_IDLE; request_argb_update();
        out[0]=ST_OK; out_len=1U; break;
    case CMD_ENTER_BOOT:
        if (plen != 0U) { out[0]=ST_BAD_ARG; out_len=1U; break; }
        heater_set(false); fan_set_pwm(0U); argb_set(0U,0U,0U); argb_flush();
        FLASH_Unlock_Fast();
        FLASH_ErasePage_Fast((0x08000000UL + 62UL*1024UL - 4UL) & 0xFFFFFF00UL);
        FLASH->CTLR |= (uint32_t)0x00008000UL;
        FLASH->CTLR |= (uint32_t)0x00000080UL;
        out[0]=ST_OK; out_len=1U; enter_boot = true; break;
    case CMD_HB:
        if (g_registered) {
            g_last_host_tick = g_tick;
        }
        out[0]=ST_OK; out[1]=DEVICE_TYPE; out[2]=DEVICE_ADDR; out_len=3U; break;
    default:
        out[0]=ST_BAD_CMD; out_len=1U; break;
    }
    bus_send(cmd, seq, out, out_len);
    if (enter_boot) {
        while ((USART1->STATR & USART_FLAG_TC) == 0U) {}
        RCC_ClearFlag();
        SystemReset_StartMode(Start_Mode_BOOT);
        NVIC_SystemReset();
        while (1) {}
    }
}

static void bus_poll(void)
{
    static uint8_t rx[9 + BUS_RX_MAX_PAYLOAD];
    static uint16_t rx_len;
    uint8_t b;
    while (bus_uart_read_byte(&b)) {
        if (rx_len >= sizeof(rx)) rx_len = 0U;
        rx[rx_len++] = b;
    }
    while (rx_len >= 2U) {
        uint16_t plen, frame_len, crc_rx, crc_calc;
        if (rx[0] != SOF0 || rx[1] != SOF1) { memmove(rx, rx+1, (size_t)(rx_len-1U)); rx_len--; continue; }
        if (rx_len < 9U) return;
        plen = get_u16le(&rx[5]);
        if (plen > BUS_RX_MAX_PAYLOAD) { memmove(rx, rx+1, (size_t)(rx_len-1U)); rx_len--; continue; }
        frame_len = (uint16_t)(9U + plen);
        if (rx_len < frame_len) return;
        crc_rx = get_u16le(&rx[7 + plen]);
        crc_calc = crc16(&rx[2], (uint16_t)(5U + plen));
        if (crc_rx == crc_calc) {
            uint8_t dest = rx[2], cmd = rx[3], seq = rx[4];
            if (dest == DEVICE_ADDR || (dest == BROADCAST_ADDR && cmd == CMD_DISCOVER)) {
                bus_handle_cmd(dest, cmd, seq, &rx[7], plen);
            }
        }
        if (rx_len > frame_len) memmove(rx, rx+frame_len, (size_t)(rx_len-frame_len));
        rx_len = (uint16_t)(rx_len - frame_len);
    }
}

static void bus_housekeeping(void)
{
    if (g_registered && (g_tick - g_last_host_tick) >= HOST_TIMEOUT_MS) {
        g_registered = 0U;
        g_hb_led_on = 0U;
        led_set(HB_LED_PORT, HB_LED_PIN, false);
        dry_stop(ERR_MASTER_LOST);
    }
}

