mengxyz/PN0031/app/ch32_v006_rewinder/src/main_heater.c
static void argb_update_task(void)
{
    if (!g_argb_update_pending) return;
    g_argb_update_pending = 0U;
    argb_status_update();
}

static void hb_led_task(void)
{
    if (!g_registered) return;
    if ((g_tick - g_last_hb_blink_tick) >= 1000U) {
        g_last_hb_blink_tick = g_tick;
        g_hb_led_on = (uint8_t)!g_hb_led_on;
        led_set(HB_LED_PORT, HB_LED_PIN, g_hb_led_on != 0U);
    }
}

static void control_task(void)
{
    int16_t target_c10;
    int16_t err;
    uint8_t max_pct;

    sample_task(false);
    if ((g_tick - g_last_control_tick) < CONTROL_MS) return;
    g_last_control_tick = g_tick;
    if (g_state != DRY_DRYING && g_state != DRY_COOLDOWN) return;

    if (g_heater_temp_c10 == TEMP_UNAVAILABLE || g_pcb_temp_c10 == TEMP_UNAVAILABLE) { dry_stop(ERR_NTC); return; }
    if (!air_sensor_online()) { dry_stop(ERR_AIR_SENSOR); return; }
    if (door_open()) {
        g_warn_bits |= WARN_DOOR_OPEN;
        g_heater_output_pct = 0U;
        heater_set(false);
        fan_set_pwm(FAN_COOL_PWM);
        return;
    }
    g_warn_bits &= (uint16_t)~WARN_DOOR_OPEN;
    if (g_pcb_temp_c10 >= 800) { dry_stop(ERR_PCB_OVERHEAT); return; }
    if (g_heater_temp_c10 >= 1100) { dry_stop(ERR_HEATER_OVERHEAT); return; }
    g_warn_bits &= (uint16_t)~(WARN_FAN | WARN_HEATER_HOT);
    if ((g_state == DRY_DRYING) && g_fan_pwm_byte >= FAN_TACH_MIN_PWM_BYTE &&
        (g_tick - g_last_fan_cmd_tick) >= FAN_TACH_FAIL_MS && g_fan_rpm == 0U) {
        dry_stop(ERR_FAN); return;
    }
    if ((g_state == DRY_DRYING) && !fan_ok()) g_warn_bits |= WARN_FAN;
    if (!power_ok()) g_warn_bits |= WARN_FAN;
    if (g_heater_temp_c10 >= 950) { g_warn_bits |= WARN_HEATER_HOT; fan_set_pwm(FAN_DRY_PWM); }

    if (g_state == DRY_COOLDOWN) {
        heater_set(false);
        if (g_heater_temp_c10 < 450) { fan_set_pwm(0U); g_state = g_error_bits ? DRY_ERROR : DRY_IDLE; }
        return;
    }

    if ((g_tick - g_dry_start_tick) >= g_dry_duration_ms) { dry_stop(0U); return; }
    g_time_left_min = (uint16_t)((g_dry_duration_ms - (g_tick - g_dry_start_tick) + 59999UL) / 60000UL);
    target_c10 = (int16_t)g_target_temp_c * 10;
    err = (int16_t)(target_c10 - g_air_temp_c10);
    if (err <= 0) g_heater_output_pct = 0U;
    else if (err >= 300) g_heater_output_pct = 100U;
    else g_heater_output_pct = (uint8_t)(err / 3);
    max_pct = ((g_tick - g_dry_start_tick) < SOFTSTART_MS) ? 35U : 100U;
    if (g_heater_output_pct > max_pct) g_heater_output_pct = max_pct;
    if ((g_tick - g_window_start_tick) >= HEATER_WINDOW_MS) g_window_start_tick = g_tick;
    heater_set(((g_tick - g_window_start_tick) < ((uint32_t)g_heater_output_pct * HEATER_WINDOW_MS / 100U)) && g_state == DRY_DRYING);
}

int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
    SystemCoreClockUpdate();
    SysTick->CTLR = 0;
    SysTick->SR = 0;
    SysTick->CMP = (SystemCoreClock / 1000U) - 1U;
    SysTick->CNT = 0;
    SysTick->CTLR = 0x0F;
    NVIC_EnableIRQ(SysTicK_IRQn);

    gpio_init_all();
    fan_tach_init();
    fan_pwm_init();
    WS2812BDMAInit();
    argb_status_update();
    bus_uart_init();
    adc_init_simple();
    air_sensor_detect();
    sample_task(true);
    g_oled_ok = oled_init() ? 1U : 0U;
    display_task(true);

    while (1) {
        bus_poll();
        bus_housekeeping();
        bus_poll();
        control_task();
        bus_poll();
        hb_led_task();
        argb_update_task();
        bus_poll();
        fan_tach_task();
        bus_poll();
        display_task(false);
        bus_poll();
    }
}
